
## :x: Apply Failed

[CI link](https://github.com/clov3r-cc/infra/actions/runs/12744425548)



<pre><code>Error: error creating access service token: Authentication error (10000)

  with cloudflare_zero_trust_access_service_token.managed,
  on cloudflare_zero_trust.tf line 44, in resource &#34;cloudflare_zero_trust_access_service_token&#34; &#34;managed&#34;:
  44: resource &#34;cloudflare_zero_trust_access_service_token&#34; &#34;managed&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
random_password.tunnel_secret: Refreshing state... [id=none]
cloudflare_zone.clov3r-cc: Refreshing state... [id=b52fd73ec52e35fea1807a173e33e93a]
cloudflare_zero_trust_access_group.allow_github: Refreshing state... [id=416409ba-aaad-420a-b2ac-a3720ec3b79b]
cloudflare_pages_project.homepage: Refreshing state... [id=my-home]
cloudflare_zero_trust_tunnel_cloudflared.cloudflared-01: Refreshing state... [id=00bab218-3cd8-4f5e-a9bb-a3aab8143173]
cloudflare_record.mail-server__spf: Refreshing state... [id=cd0e9cf33082257df334d07d014a2276]
cloudflare_record.github-pages_domain_verification: Refreshing state... [id=267e530d9efe22ef43f930a7669d7fae]
cloudflare_record.auth0_domain: Refreshing state... [id=cbad6efceb5b3e583b9f7d82ffc000bb]
cloudflare_record.mail-server__dmarc: Refreshing state... [id=d3f27ef9ad851ee35a1e208b1788ae61]
cloudflare_record.mail-server__secondary: Refreshing state... [id=f3f867226f368d46929b2f17992ee80c]
cloudflare_record.mail-server__dkim: Refreshing state... [id=21cf1425547db355cd4db7911b5d3d59]
cloudflare_record.mail-server__primary: Refreshing state... [id=686562cc12e38b9403f01f7e4b2219c6]
cloudflare_zero_trust_access_application.pxmx01-mng: Refreshing state... [id=c4632b38-09e8-49bb-b706-06e5c0045240]
cloudflare_pages_domain.www-clov3r-cc: Refreshing state... [id=dd9f9254-08d7-4d24-b2c0-1858b22c9239]
cloudflare_record.homepage: Refreshing state... [id=9245de49ae1dd3c35e86c85664779f6d]
cloudflare_pages_domain.clov3r-cc: Refreshing state... [id=8de8d491-37e4-4dfe-a69b-3b37982ba23f]
cloudflare_record.homepage__www: Refreshing state... [id=8c52a886f760fd39d56f8f73e61059a6]
cloudflare_zero_trust_access_policy.pxmx01-mng: Refreshing state... [id=bbe2f85f-295a-4be9-a2a7-d700ea04a037]
cloudflare_record.pxmx01-mng: Refreshing state... [id=5e8ba12e8675681f04a74a8ac6fbeb87]
cloudflare_zero_trust_tunnel_cloudflared_config.cloudflared-01: Refreshing state... [id=00bab218-3cd8-4f5e-a9bb-a3aab8143173]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_zero_trust_access_policy.pxmx01-mng will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "pxmx01-mng" {
        id                             = "bbe2f85f-295a-4be9-a2a7-d700ea04a037"
        name                           = "Policy for pxmx01-mng.clov3r.cc"
        # (8 unchanged attributes hidden)

      + include {
          + service_token = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # cloudflare_zero_trust_access_service_token.managed will be created
  + resource "cloudflare_zero_trust_access_service_token" "managed" {
      + client_id            = (known after apply)
      + client_secret        = (sensitive value)
      + duration             = "8760h"
      + expires_at           = (known after apply)
      + id                   = (known after apply)
      + min_days_for_renewal = 0
      + name                 = "managed token"
      + zone_id              = "b52fd73ec52e35fea1807a173e33e93a"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
cloudflare_zero_trust_access_service_token.managed: Creating...

Error: error creating access service token: Authentication error (10000)

  with cloudflare_zero_trust_access_service_token.managed,
  on cloudflare_zero_trust.tf line 44, in resource "cloudflare_zero_trust_access_service_token" "managed":
  44: resource "cloudflare_zero_trust_access_service_token" "managed" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tf_apply","PRNumber":29,"Program":"tfcmt","SHA1":"6996a0a871bf55463fd935150c2221c1d2782033","Vars":{},"WorkflowName":"Terraform"} -->